       IDENTIFICATION DIVISION.
       PROGRAM-ID. MINFUNCTIONINDEX.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM-INDEX PIC 9 VALUE 2.
       01 INPUT-AMT PIC 99 OCCURS 2.
       01 RESULT-VALUE PIC 99.
       PROCEDURE DIVISION.
           COMPUTE RESULT-VALUE =
               FUNCTION REM(INPUT-AMT(ITEM-INDEX), 5)
           GOBACK.
