 IDENTIFICATION DIVISION.
 PROGRAM-ID. TBLARTH.
 DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-TBL.
     05 WS-RECORD OCCURS 3 TIMES INDEXED BY I.
       10 WS-COLUMN PIC X(3).

 PROCEDURE DIVISION.
   DISPLAY WS-RECORD(I - 1).
